Revit 2027 API
AssetPropertyBoolean.Value Property
 The value of the property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Value { get; set; }
Public Property Value As Boolean
	Get
	Set
public:
property bool Value {
	bool get ();
	void set (bool value);
}
member Value : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input value is invalid for this AssetPropertyBoolean property.
InvalidOperationException |  When setting this property: The asset property is not editable.
See Also
Reference
AssetPropertyBoolean Class
Autodesk.Revit.DB.Visual Namespace